xx/UsLmtChg.xml

<soap:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:s="http://esb.spdbbiz.com/services/{{serverid}}" xmlns:d="http://esb.spdbbiz.com/metadata">
	<soap:Header>
		<s:RspHeader>
			<d:Mac />
			<d:MacOrgId />
			<d:MsgId />
			<d:TargetSysId />
			<d:RelatedMsgId />
			<d:ServiceAdr />
			<d:ServiceAction />
			<d:ExtendContent />
		</s:RspHeader>
	</soap:Header>
	<soap:Body>
		<s:RspUsLmtChg>
			<s:RspSvcHeader>
				<s:TranDate />
				<s:TranTime />
				<s:BackendSeqNo />
				<s:BackendSysId />
				<s:ReturnCode>000000000000</s:ReturnCode>
				<s:ReturnMsg>Powered By Mock</s:ReturnMsg>
				<s:GlobalSeqNo />
				<s:LangCode />
				<s:TranCode />
				<s:PIN />
				<s:KeyVersionNo />
				<s:TargetAdr />
				<s:SourceAdr />
				<s:MsgEndFlag />
				<s:MsgSeqNo />
				<s:LinkTranCode />
				<s:TranSerialNo />
				<s:InttrId>04</s:InttrId>
				<s:InttrTranDate>20170530</s:InttrTranDate>
				<s:InttrTranTime>152558</s:InttrTranTime>
				<s:InttrTranSeqNo>110503370001</s:InttrTranSeqNo>
				<s:InttrAcntgDate>20170530</s:InttrAcntgDate>
				<s:RcvrId>04</s:RcvrId>
				<s:HUBSeqNo>201708180000000003876154</s:HUBSeqNo>
				<s:HUBStrtTime>152831</s:HUBStrtTime>
				<s:HUBEndTime>152832</s:HUBEndTime>
				<s:RcvrTranSeqNo>1213279</s:RcvrTranSeqNo>
				<s:RcvrTranStrtTime>152831</s:RcvrTranStrtTime>
				<s:RcvrTranEndTime>152832</s:RcvrTranEndTime>
				<s:RcvrTranStatus />
				<s:LstExecNode>2</s:LstExecNode>
				<s:HUBRetCode>000000</s:HUBRetCode>
				<s:AplRetCode>CL5037</s:AplRetCode>
				<s:AplRetInfo>EARMARK RECORD NOT FOUND</s:AplRetInfo>
			</s:RspSvcHeader>
			<s:SvcBody>
				<s:LmtNo>2017000153</s:LmtNo>
				<s:SerialNo>201705021213222</s:SerialNo>
				<s:ExpiredDate />
				<s:OdraftLmt />
				<s:SptmOdraftLmt />
				<s:RetRcrdNum1>0</s:RetRcrdNum1>
				<s:RetOdraftLmtRcrdNum>0</s:RetOdraftLmtRcrdNum>
			</s:SvcBody>
		</s:RspUsLmtChg>
	</soap:Body>
</soap:Envelope>